Revit 2024 API
EnergyAnalysisWindowType.SolarHeatGainCoefficient Property
 The solar heat gain coefficient (SHGC-value) for the window type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double SolarHeatGainCoefficient { get; }
Visual Basic
Public ReadOnly Property SolarHeatGainCoefficient As Double
	Get
Visual C++
public:
property double SolarHeatGainCoefficient {
	double get ();
}
See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace